post/Programing/C_language/C_languare_useful_note.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="description" content="抄别人blog的东西，塞一起应该方便自己查吧？" />
<meta charset="utf-8" />
<title>C语言速查笔记</title>
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="#"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div>
<div id="content" class="content">
<h1 class="title">C语言速查笔记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul><li><a href="#org-title-1">1. 前言</a></li><li><a href="#org-title-2">2. 使用ANSI转义字符为打印的字符上色</a><ul><li><a href="#org-title-2-1">2.1. 颜色</a><ul><li><a href="#org-title-2-1-1">2.1.1. 使用普通颜色（非256色）</a></li><li><a href="#org-title-2-1-2">2.1.2. 使用真彩色（256色）</a></li></ul></li>
<li><a href="#org-title-2-2">2.2. 文字效果</a></li><li><a href="#org-title-2-3">2.3. 其他类型</a><ul><li><a href="#org-title-2-3-1">2.3.1. 光标移动</a></li><li><a href="#org-title-2-3-2">2.3.2. 光标显示</a></li><li><a href="#org-title-2-3-3">2.3.3. 光标位置</a></li></ul></li></ul></li>
<li><a href="#org-title-3">3. Linux Signal信号</a></li><li><a href="#org-title-4">4. RELRO等安全选项</a></li><li><a href="#org-title-5">5. 判断字符是中文还是英文(有局限)</a></li><li><a href="#org-title-6">6. 生成迷宫</a></li></ul></div></div>
<div class="outline-2">
<h2 id="org-title-1"><span class="section-number-2">1.</span> 前言</h2><div class="outline-text-2" id="text-1"><p>这玩意还是我自己吃菌子吃多了头脑发热写的东西，不过他应该不会像隔壁“某教程”那样写着写着就弃坑变成了烂尾楼</p><p>当然，真正的理由还是翻自己的收藏夹发现收藏了一堆网页，但一大堆都是CSDN的shit，想着能不能把他们从收藏夹里面“优化”掉，所以就想抄到自己这里来hhh</p><p>以下内容或许可以参考
<a href="https://gitee.com/YouLanjie/my-test">这个仓库</a>的C语言部分，我有些实例代码是写在里面的</p></div></div><div class="outline-2">
<h2 id="org-title-2"><span class="section-number-2">2.</span> 使用ANSI转义字符为打印的字符上色</h2><div class="outline-text-2" id="text-2"><p>特殊效果的支持源自ANSI标准，由于我不是很懂所以不多赘述。这里重点关注我们应该如何使用它。</p><p>先说结论：<br/> 要使用特殊效果，通常需要使用任意输出函数输出以 <code>\033[数字选项+字符选项</code> 为格式的字符串。</p><p>其中，字符选项相当于指定了其大概的类型，只可以单独使用，并作为一串控制字符串的结束。而数字选项则是细分了其具体功能，且可以复用，只需要使用分号将其隔开。</p><p>例子请续看下文。</p></div><div class="outline-3">
<h3 id="org-title-2-1"><span class="section-number-3">2.1.</span> 颜色</h3><div class="outline-text-3" id="text-2-1"><blockquote>
<p>做出一些提醒，该子标题内的内容都需要一个关键的字符 <code>m</code> ，所有的文字效果都是基于 <code>\033[XXm</code> 的格式，只是为了方便理解，在大部分内容都不作为重点讲述。</p></blockquote></div><div class="outline-4">
<h4 id="org-title-2-1-1"><span class="section-number-4">2.1.1.</span> 使用普通颜色（非256色）</h4><div class="outline-text-4" id="text-2-1-1"><p>要打印出普通的颜色，只需要使用下面的程序：</p><div class="org-src-container"><pre class="src src-c"><span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;stdio.h&gt;</span>

<span class="kt">int</span><span class="w"> </span><span class="nf">main</span><span class="p">()</span>
<span class="p">{</span>
<span class="w">        </span><span class="kt">int</span><span class="w"> </span><span class="n">color_code</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">31</span><span class="p">;</span><span class="w">    </span><span class="cm">/* 这里使用变量不是必须的，只是为了更容易看懂，实际上需要打印出对应的数字即可 */</span>
<span class="w">        </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;</span><span class="se">\033</span><span class="s">[%dm&quot;</span>
<span class="w">               </span><span class="s">&quot;在这里放你想要带特殊效果打印的东西</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">,</span>
<span class="w">               </span><span class="n">color_code</span><span class="p">);</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div><p>下面是所有关于颜色控制的数字表格，左侧是字体颜色，右侧是背景颜色。</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" />
<col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">数字</th><th scope="col" class="org-left">字体颜色</th><th scope="col" class="org-left">数字</th><th scope="col" class="org-left">背景颜色</th></tr>
</thead><tbody>
<tr><td class="org-left">30</td><td class="org-left">黑色</td><td class="org-left">40</td><td class="org-left">默认/无色</td></tr><tr><td class="org-left">31</td><td class="org-left">红色</td><td class="org-left">41</td><td class="org-left">红色</td></tr><tr><td class="org-left">32</td><td class="org-left">绿色</td><td class="org-left">42</td><td class="org-left">绿色</td></tr><tr><td class="org-left">33</td><td class="org-left">黄色/橙色</td><td class="org-left">43</td><td class="org-left">黄色/橙色</td></tr><tr><td class="org-left">34</td><td class="org-left">蓝色</td><td class="org-left">44</td><td class="org-left">蓝色</td></tr><tr><td class="org-left">35</td><td class="org-left">紫色</td><td class="org-left">45</td><td class="org-left">紫色</td></tr><tr><td class="org-left">36</td><td class="org-left">青色</td><td class="org-left">46</td><td class="org-left">青色</td></tr><tr><td class="org-left">37</td><td class="org-left">白色</td><td class="org-left">47</td><td class="org-left">白色</td></tr></table><blockquote>
<p>顺带一提，这些控制代码是“可堆叠的”，意思就是不通的颜色代码可以使用分号 <code>;</code> 隔断开来，这样就不必打上好几个 <code>\033[...</code> 让代码变得难以阅读。这里再举一个例子做示范。</p><div class="org-src-container"><pre class="src src-c"><span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;stdio.h&gt;</span>
<span class="kt">int</span><span class="w"> </span><span class="nf">main</span><span class="p">()</span>
<span class="p">{</span>
<span class="w">        </span><span class="kt">int</span><span class="w"> </span><span class="n">color_code_bg</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">44</span><span class="p">,</span><span class="w">    </span><span class="cm">/* 蓝色背景 */</span>
<span class="w">            </span><span class="n">color_code_fg</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">31</span><span class="p">;</span><span class="w">    </span><span class="cm">/* 红色字体 */</span>
<span class="w">        </span><span class="cm">/* 这里的转义相当于 \033[44;31m */</span>
<span class="w">        </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;</span><span class="se">\033</span><span class="s">[%d;%dm&quot;</span>
<span class="w">               </span><span class="s">&quot;Put someting here you want to print.</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">,</span>
<span class="w">               </span><span class="n">color_code_bg</span><span class="p">,</span><span class="w"> </span><span class="n">color_code_fg</span><span class="p">);</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div></blockquote></div></div><div class="outline-4">
<h4 id="org-title-2-1-2"><span class="section-number-4">2.1.2.</span> 使用真彩色（256色）</h4><div class="outline-text-4" id="text-2-1-2"><p>在这种情况下，我们可以打印出256种颜色，比普通颜色高级多了。不过我也还是不知道Vim 和Emacs这些编辑器使用主题时是怎样打印任意颜色的。毕竟我取过色，发现我使用的主题有很多都不在256色的范围内，所以说挺令我困惑的。</p><p>废话少说，先上代码示范。</p><div class="org-src-container"><pre class="src src-c"><span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;stdio.h&gt;</span>

<span class="kt">int</span><span class="w"> </span><span class="nf">main</span><span class="p">()</span>
<span class="p">{</span>
<span class="w">        </span><span class="kt">int</span><span class="w"> </span><span class="n">color_code</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span>
<span class="w">        </span><span class="cm">/* 在这里将各段控制字符分开是为了方便理解，不是必须的 */</span>
<span class="w">        </span><span class="k">for</span><span class="w"> </span><span class="p">(</span><span class="n">color_code</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span><span class="w"> </span><span class="n">color_code</span><span class="w"> </span><span class="o">&lt;</span><span class="w"> </span><span class="mi">256</span><span class="p">;</span><span class="w"> </span><span class="n">color_code</span><span class="o">++</span><span class="p">)</span><span class="w"> </span><span class="p">{</span>
<span class="w">                </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">color_code</span><span class="w"> </span><span class="o">&gt;=</span><span class="w"> </span><span class="mi">16</span><span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="p">(</span><span class="n">color_code</span><span class="w"> </span><span class="o">-</span><span class="w"> </span><span class="mi">16</span><span class="p">)</span><span class="w"> </span><span class="o">%</span><span class="w"> </span><span class="mi">6</span><span class="w"> </span><span class="o">==</span><span class="w"> </span><span class="mi">0</span><span class="p">)</span><span class="w"> </span><span class="p">{</span>
<span class="w">                        </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">);</span>
<span class="w">                </span><span class="p">}</span>
<span class="w">                </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;</span><span class="se">\033</span><span class="s">[&quot;</span>
<span class="w">                       </span><span class="s">&quot;48;&quot;</span>
<span class="w">                       </span><span class="s">&quot;5;&quot;</span>
<span class="w">                       </span><span class="s">&quot;%dm&quot;</span>
<span class="w">                       </span><span class="s">&quot;%03d&quot;</span>
<span class="w">                       </span><span class="s">&quot;</span><span class="se">\033</span><span class="s">[0m &quot;</span><span class="p">,</span>
<span class="w">                       </span><span class="n">color_code</span><span class="p">,</span><span class="w"> </span><span class="n">color_code</span><span class="p">);</span>
<span class="w">        </span><span class="p">}</span>
<span class="w">        </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">);</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div><p>下面开始讲解。</p><p>要想使用256色的输出，你需要的是 <code>48;5;%dm</code> 这样一串控制符。其中的 <code>48;5;</code> 就是关键。</p><p>在这里 <code>48</code> 的意思实际上应该是告诉颜色的类型是背景颜色，如果想要设置字体的颜色，只需要将其替换成 <code>38</code> 即可。</p><p>接下来的 <code>5</code> 我就不清楚具体的作用了。我只提上一点：如果单独使用它，那么它所对应的效果实际上是 <b>字体闪烁</b> 。</p></div></div></div><div class="outline-3">
<h3 id="org-title-2-2"><span class="section-number-3">2.2.</span> 文字效果</h3><div class="outline-text-3" id="text-2-2"><p>如果你观察仔细，就应该会发现刚刚的代码里面有一些新的控制符，例如刚刚提到的 <code>\033[5m;</code> 也有 <code>\033[0m</code> 。现在，是时候列出一个效果列表了。</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">控制符</th><th scope="col" class="org-left">效果</th></tr>
</thead><tbody>
<tr><td class="org-left">0</td><td class="org-left">清除所有文字效果</td></tr><tr><td class="org-left">1</td><td class="org-left">加粗文字</td></tr><tr><td class="org-left">2</td><td class="org-left">细化文字</td></tr><tr><td class="org-left">3</td><td class="org-left">斜体</td></tr><tr><td class="org-left">4</td><td class="org-left">下划线</td></tr><tr><td class="org-left">5</td><td class="org-left">闪烁</td></tr><tr><td class="org-left">6</td><td class="org-left">未知</td></tr><tr><td class="org-left">7</td><td class="org-left">颜色反转（字体和背景颜色互换）</td></tr><tr><td class="org-left">8</td><td class="org-left">隐藏字体（或许可以尝试做一些彩蛋？）</td></tr></table></div></div><div class="outline-3">
