post/Programing/C_language/C_languare_useful_note.html
<h3 id="org-title-2-3"><span class="section-number-3">2.3.</span> 其他类型</h3><div class="outline-4">
<h4 id="org-title-2-3-1"><span class="section-number-4">2.3.1.</span> 光标移动</h4><div class="outline-text-4" id="text-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">空字符</th><th scope="col" class="org-left">效果</th></tr>
</thead><tbody>
<tr><td class="org-left">D</td><td class="org-left">左</td></tr><tr><td class="org-left">C</td><td class="org-left">右</td></tr><tr><td class="org-left">A</td><td class="org-left">上</td></tr><tr><td class="org-left">B</td><td class="org-left">下</td></tr></table><p>这种情况下，数字参数用于指定步数</p></div></div><div class="outline-4">
<h4 id="org-title-2-3-2"><span class="section-number-4">2.3.2.</span> 光标显示</h4><div class="outline-text-4" id="text-2-3-2"><p>隐藏光标： <code>\033[?25l</code></p><p>显示光标： <code>\033[?25h</code></p></div></div><div class="outline-4">
<h4 id="org-title-2-3-3"><span class="section-number-4">2.3.3.</span> 光标位置</h4><div class="outline-text-4" id="text-2-3-3"><p>保存： <code>\033[u</code></p><p>还原： <code>\033[l</code></p></div></div></div></div><div class="outline-2">
<h2 id="org-title-3"><span class="section-number-2">3.</span> Linux Signal信号</h2><div class="outline-text-2" id="text-3"><p><a href="https://www.cnblogs.com/frisk/p/11602973.html">来源</a></p><div class="org-src-container"><pre class="src src-c"><span class="n">SIGHUP</span><span class="w">       </span><span class="mi">1</span><span class="w">          </span><span class="cm">/* Hangup (POSIX).  */</span><span class="w">                          </span><span class="n">终止进程</span><span class="w">     </span><span class="n">终端线路挂断</span>
<span class="n">SIGINT</span><span class="w">       </span><span class="mi">2</span><span class="w">       </span><span class="cm">/* Interrupt (ANSI).  */</span><span class="w">                        </span><span class="n">终止进程</span><span class="w">     </span><span class="n">中断进程</span><span class="w"> </span><span class="n">Ctrl</span><span class="o">+</span><span class="n">C</span>
<span class="n">SIGQUIT</span><span class="w">      </span><span class="mi">3</span><span class="w">          </span><span class="cm">/* Quit (POSIX).  */</span><span class="w">                            </span><span class="n">建立CORE文件终止进程</span><span class="err">，</span><span class="n">并且生成core文件</span><span class="w"> </span><span class="n">Ctrl</span><span class="o">+</span>\
<span class="n">SIGILL</span><span class="w">       </span><span class="mi">4</span><span class="w">          </span><span class="cm">/* Illegal instruction (ANSI).  */</span><span class="w">              </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">非法指令</span>
<span class="n">SIGTRAP</span><span class="w">      </span><span class="mi">5</span><span class="w">          </span><span class="cm">/* Trace trap (POSIX).  */</span><span class="w">                      </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">跟踪自陷</span>
<span class="n">SIGABRT</span><span class="w">      </span><span class="mi">6</span><span class="w">          </span><span class="cm">/* Abort (ANSI).  */</span>
<span class="n">SIGIOT</span><span class="w">       </span><span class="mi">6</span><span class="w">          </span><span class="cm">/* IOT trap (4.2 BSD).  */</span><span class="w">                      </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">执行I</span><span class="o">/</span><span class="n">O自陷</span>
<span class="n">SIGBUS</span><span class="w">       </span><span class="mi">7</span><span class="w">          </span><span class="cm">/* BUS error (4.2 BSD).  */</span><span class="w">                     </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">总线错误</span>
<span class="n">SIGFPE</span><span class="w">       </span><span class="mi">8</span><span class="w">          </span><span class="cm">/* Floating-point exception (ANSI).  */</span><span class="w">         </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">浮点异常</span>
<span class="n">SIGKILL</span><span class="w">      </span><span class="mi">9</span><span class="w">        </span><span class="cm">/* Kill, unblockable (POSIX).  */</span><span class="w">               </span><span class="n">终止进程</span><span class="w">     </span><span class="n">杀死进程</span>
<span class="n">SIGUSR1</span><span class="w">      </span><span class="mi">10</span><span class="w">         </span><span class="cm">/* User-defined signal 1 (POSIX).  */</span><span class="w">           </span><span class="n">终止进程</span><span class="w">     </span><span class="n">用户定义信号1</span>
<span class="n">SIGSEGV</span><span class="w">      </span><span class="mi">11</span><span class="w">         </span><span class="cm">/* Segmentation violation (ANSI).  */</span><span class="w">           </span><span class="n">建立CORE文件</span><span class="p">,</span><span class="n">段非法错误</span>
<span class="n">SIGUSR2</span><span class="w">      </span><span class="mi">12</span><span class="w">         </span><span class="cm">/* User-defined signal 2 (POSIX).  */</span><span class="w">           </span><span class="n">终止进程</span><span class="w">     </span><span class="n">用户定义信号2</span>
<span class="n">SIGPIPE</span><span class="w">      </span><span class="mi">13</span><span class="w">         </span><span class="cm">/* Broken pipe (POSIX).  */</span><span class="w">                     </span><span class="n">终止进程</span><span class="w">     </span><span class="n">向一个没有读进程的管道写数据</span>
<span class="n">SIGALARM</span><span class="w">     </span><span class="mi">14</span><span class="w">       </span><span class="cm">/* Alarm clock (POSIX).  */</span><span class="w">                     </span><span class="n">终止进程</span><span class="w">     </span><span class="n">计时器到时</span>
<span class="n">SIGTERM</span><span class="w">      </span><span class="mi">15</span><span class="w">       </span><span class="cm">/* Termination (ANSI).  */</span><span class="w">                      </span><span class="n">终止进程</span><span class="w">     </span><span class="n">软件终止信号</span>
<span class="n">SIGSTKFLT</span><span class="w">    </span><span class="mi">16</span><span class="w">         </span><span class="cm">/* Stack fault.  */</span>
<span class="n">SIGCLD</span><span class="w">       </span><span class="n">SIGCHLD</span><span class="w">    </span><span class="cm">/* Same as SIGCHLD (System V).  */</span>
<span class="n">SIGCHLD</span><span class="w">      </span><span class="mi">17</span><span class="w">         </span><span class="cm">/* Child status has changed (POSIX).  */</span><span class="w">        </span><span class="n">忽略信号</span><span class="w">     </span><span class="n">当子进程停止或退出时通知父进程</span>
<span class="n">SIGCONT</span><span class="w">      </span><span class="mi">18</span><span class="w">         </span><span class="cm">/* Continue (POSIX).  */</span><span class="w">                        </span><span class="n">忽略信号</span><span class="w">     </span><span class="n">继续执行一个停止的进程</span>
<span class="n">SIGSTOP</span><span class="w">      </span><span class="mi">19</span><span class="w">         </span><span class="cm">/* Stop, unblockable (POSIX).  */</span><span class="w">               </span><span class="n">停止进程</span><span class="w">     </span><span class="n">非终端来的停止信号</span>
<span class="n">SIGTSTP</span><span class="w">      </span><span class="mi">20</span><span class="w">         </span><span class="cm">/* Keyboard stop (POSIX).  */</span><span class="w">                   </span><span class="n">停止进程</span><span class="w">     </span><span class="n">终端来的停止信号</span><span class="w"> </span><span class="n">Ctrl</span><span class="o">+</span><span class="n">Z</span>
<span class="n">SIGTTIN</span><span class="w">      </span><span class="mi">21</span><span class="w">         </span><span class="cm">/* Background read from tty (POSIX).  */</span><span class="w">        </span><span class="n">停止进程</span><span class="w">     </span><span class="n">后台进程读终端</span>
<span class="n">SIGTTOU</span><span class="w">      </span><span class="mi">22</span><span class="w">         </span><span class="cm">/* Background write to tty (POSIX).  */</span><span class="w">         </span><span class="n">停止进程</span><span class="w">     </span><span class="n">后台进程写终端</span>
<span class="n">SIGURG</span><span class="w">       </span><span class="mi">23</span><span class="w">         </span><span class="cm">/* Urgent condition on socket (4.2 BSD).  */</span><span class="w">    </span><span class="n">忽略信号</span><span class="w">     </span><span class="n">I</span><span class="o">/</span><span class="n">O紧急信号</span>
<span class="n">SIGXCPU</span><span class="w">      </span><span class="mi">24</span><span class="w">         </span><span class="cm">/* CPU limit exceeded (4.2 BSD).  */</span><span class="w">            </span><span class="n">终止进程</span><span class="w">     </span><span class="n">CPU时限超时</span>
<span class="n">SIGXFSZ</span><span class="w">      </span><span class="mi">25</span><span class="w">         </span><span class="cm">/* File size limit exceeded (4.2 BSD).  */</span><span class="w">      </span><span class="n">终止进程</span><span class="w">     </span><span class="n">文件长度过长</span>
<span class="n">SIGVTALRM</span><span class="w">    </span><span class="mi">26</span><span class="w">         </span><span class="cm">/* Virtual alarm clock (4.2 BSD).  */</span><span class="w">           </span><span class="n">终止进程</span><span class="w">     </span><span class="n">虚拟计时器到时</span>
<span class="n">SIGPROF</span><span class="w">      </span><span class="mi">27</span><span class="w">         </span><span class="cm">/* Profiling alarm clock (4.2 BSD).  */</span><span class="w">         </span><span class="n">终止进程</span><span class="w">     </span><span class="n">统计分布图用计时器到时</span>
<span class="n">SIGWINCH</span><span class="w">     </span><span class="mi">28</span><span class="w">         </span><span class="cm">/* Window size change (4.3 BSD, Sun).  */</span><span class="w">       </span><span class="n">忽略信号</span><span class="w">     </span><span class="n">窗口大小发生变化</span>
<span class="n">SIGPOLL</span><span class="w">      </span><span class="n">SIGIO</span><span class="w">      </span><span class="cm">/* Pollable event occurred (System V).  */</span>
<span class="n">SIGIO</span><span class="w">        </span><span class="mi">29</span><span class="w">         </span><span class="cm">/* I/O now possible (4.2 BSD).  */</span><span class="w">              </span><span class="n">忽略信号</span><span class="w">     </span><span class="n">描述符上可以进行I</span><span class="o">/</span><span class="n">O</span>
<span class="n">SIGPWR</span><span class="w">       </span><span class="mi">30</span><span class="w">         </span><span class="cm">/* Power failure restart (System V).  */</span>
<span class="n">SIGSYS</span><span class="w">       </span><span class="mi">31</span><span class="w">         </span><span class="cm">/* Bad system call.  */</span>
<span class="n">SIGUNUSED</span><span class="w">    </span><span class="mi">31</span>
</pre></div></div></div><div class="outline-2">
<h2 id="org-title-4"><span class="section-number-2">4.</span> RELRO等安全选项</h2><div class="outline-text-2" id="text-4"><p><a href="https://blog.csdn.net/tabactivity/article/details/126660974">来源</a> 编译时使用 <code>-z now</code> 选项</p></div></div><div class="outline-2">
