post/Programing/C_language/C_languare_useful_note.org
* 判断字符是中文还是英文(有局限)
[[https://blog.csdn.net/shen_chengfeng/article/details/109161829][来源]]
#+begin_src c
  #include <stdio.h>
  #include <string.h>
   
  int main(int argc, char** argv)
  {
  	if(argc != 2) {
  		printf("Usage:\n./xxx str\n");
  		return 0;
  	}
  	
  	char *p = argv[1];
  	int   len = strlen(p);
  	for(int i = 0; i < len; i++) {
  		if( *p & 0x80) {
  			printf("chinese: %x\n", *p);
  		} else {
  			printf("english: %x\n", *p);
  		}
  		p++;
  	}
  	return 0;
  }
#+end_src
（以上代码可在my-test中找到）

